/*****************************************************************************
*|------------------------------PE4032驱动库--------------------------------|*
*|-----------------------------@大四十七高材生------------------------------|*
*|---------------------------------2021.5.11--------------------------------|*
*|==========================================================================|*
*|移植指南：														   		|*
*|	一、适用条件															|*
*|		PE4302工作在串行模式（P/S=1）										|*
*|																			|*
*|	二、引脚连接：															|*
*|		PE4302<---->MCU														|*
*|																			|*
*|		C16<-------->NA														|*
*|		Data<------>*OUT													|*
*|		Clock<----->*OUT													|*
*|		LE<-------->*OUT													|*
*|		PUP1<------->NA														|*
*|		PUP2<------->NA														|*
*|		P/S<------->VCC														|*
*|		C8<--------->NA														|*
*|		C4<--------->NA														|*
*|		C2<--------->NA														|*
*|		C1<--------->NA														|*
*|		C0.5<------->NA														|*
*|																			|*
*|		OUT：推挽/上拉输出													|*
*|		NA：任意，可以省略													|*
*|		*：重要的、必须使用的IO，不能省略									|*
*|																			|*
*|	三、调试信息：													   		|*
*|		已在STM32F429IGT6上使用软件模拟SPI通过					   			|*
*****************************************************************************/

#ifndef _PE4302_H_
#define _PE4302_H_
#include <stdint.h>
#include "Framework.h"

typedef struct pe4302_class
{
	/*==============================成员变量===============================*/
	
	ro float       Actual_Attenuation; //实际衰减值（dB）
	ro gpio_type   DATA;               //数据线
    ro gpio_type   CLK;                //时钟线
    ro gpio_type   LE;                 //锁存信号
    
	
	/*================================方法=================================*/
	/****************************************************
	*功能：设置衰减值									*
	*参数：1.device：类的实例							*
	*	   2.atn：衰减值（dB）							*
	*说明：需要注意PE4302衰减步进为0.5dB，此方法会自动	*
	*	   选取最接近的衰减值，例如：如果atn=1.6则实际	*
	*	   衰减值为1.5。时刻注意atn的范围：0~31.5。如果	*
	*	   atn>31.5则实际衰减值为31.5dB，如果atn<0，则实*
	*	   际衰减值会被设置为0dB。						*
	*****************************************************/
	void (*Set_Attenuation)		(struct pe4302_class* device ,float atn);
	
	/****************************************************
	*功能：设置衰减值									*
	*参数：1.device：类的实例							*
	*	   2.atn：衰减值（倍数）						*
	*说明：此方法将衰减值（倍数）转化为dB，并设置芯片的	*
	*	   衰减值。在这种条件下atn范围是：0~37.58374	*
	*****************************************************/
	void (*Set_Attenuation2)	(struct pe4302_class* device ,float atn);
	
} pe4302;

/********************************************
*功能：PE4302初始化   						*
*参数：1.dev：类实例                       	*
*      2.data：DATA对应的引脚               *
*      3.sclk：CLK对应的引脚                *
*      4.le：LE对应的引脚                   *
*返回值：类的实例							*
*********************************************/
void PE4302_Prepare(pe4302* dev, gpio_type data, gpio_type sclk, gpio_type le);


#endif
